app/views/articles/show.html.erb

SELECT "comments".* FROM "comments"  WHERE "comments"."article_id" = ?  [["article_id", 1]]
---
<h2 class="c">Comments:</h2>
<%@article.comments.each do |c|%>