app/controllers/articles_controller.rb

  def create
  	@article = Article.new(a_params)
   if @article.save
---
INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)

  def update
  @article = Article.find(params[:id])
  if @article.update(a_params)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = 1  [["title", "First Article , Hello world!"], ["updated_at", "2014-06-07 17:53:19.839367"]]